# inconsistent data 
 1. date format
 2. naming convention format error
 3. typographical error
 4. removing contridications or illogical data points that does'not make sense
 5. removing duplicates

In [1]:
# import libraries 
import pandas as pd
import numpy as np 
import seaborn as sns

In [2]:
# example data 
data = {'date':['2020-11-02','2020/11/03','2020-04-24','25-04-2021'],
        'name':['jhon don','john don','jane don','jane doe'] ,
        'country':['usa','USA','united states of america','u.s.a'],
        'sales_2022':[100,200 ,None,200],
        'sales_2023':[100,200,None,200]}
# convert pandas data frame 
df=pd.DataFrame(data)

In [3]:
df.head()

         date      name                   country  sales_2022  sales_2023
0  2020-11-02  jhon don                       usa       100.0       100.0
1  2020/11/03  john don                       USA       200.0       200.0
2  2020-04-24  jane don  united states of america         NaN         NaN
3  25-04-2021  jane doe                     u.s.a       200.0       200.0

 # standarizing the data format

In [4]:
# here we have the data with inconsistent format 
# first we are going to remove inconsentency in data 
df['date']=pd.to_datetime(df['date'],errors='coerce')
df.head()

        date      name                   country  sales_2022  sales_2023
0 2020-11-02  jhon don                       usa       100.0       100.0
1        NaT  john don                       USA       200.0       200.0
2 2020-04-24  jane don  united states of america         NaN         NaN
3        NaT  jane doe                     u.s.a       200.0       200.0

In [ ]:
df['date']=pd.to_datetime(df['date'],errors='coerce')
df['date']=df['date'].dt.strftime('%d-%m-%y')

df['date']=df['date'].fillna('02-11-2022')
df.head()

In [5]:
df.dtypes

date          datetime64[ns]
name                  object
country               object
sales_2022           float64
sales_2023           float64
dtype: object

## assingment fill the date column and try another method to format the date column

In [25]:
# now how to settle country name 
country_mapping={'usa':'united states','USA':'united states','united states of america':'united states','u.s.a':'united states'}
df['country']=df['country'].replace(country_mapping)
df.head()

       date      name        country  sales_2022  sales_2023
0  02-11-20  john doe  united states       100.0       100.0
2  24-04-20  jane doe  united states         NaN         NaN

# correct the typogarphical mistake

In [23]:
df['name']=df['name'].replace({'jhon don':'john doe','jane don':'jane doe','john don':'john doe'})

df.head()

       date      name        country  sales_2022  sales_2023
0  02-11-20  john doe  united states       100.0       100.0
2  24-04-20  jane doe  united states         NaN         NaN

# remove duplicates

In [21]:
# df=df.drop_duplicates('name')
# df.head()

       date      name        country  sales_2022  sales_2023
0  02-11-20  john doe  united states       100.0       100.0
2  24-04-20  jane doe  united states         NaN         NaN

In [24]:
# practice on another dataset 
df.head()

       date      name        country  sales_2022  sales_2023
0  02-11-20  john doe  united states       100.0       100.0
2  24-04-20  jane doe  united states         NaN         NaN

# removing ilogical contridications

In [ ]:
# let assume sales_2023 should be higher then sales_2022
# removing condtriditry error
df=df.drop(df['sales_2023']<=df['sales_2022'].index)
df.head()